Tekla Open API Reference for Tekla Structures 2025
AnalysisEccentricity Class
 The AnalysisEccentricity class contains eccentricity information for an analysis model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisEccentricity
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisEccentricity
Public Class AnalysisEccentricity
The AnalysisEccentricity type exposes the following members.
Constructors
Name | Description
AnalysisEccentricity
 Creates a new analysis eccentricity instance.
Top
Properties
Name | Description
End
 The eccentricity at the end.
Start
 The eccentricity at the start.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace